app/controllers/galleries_controller.rb

INSERT INTO "galleries" ("name", "description", "restaurant_id", "created_at", "updated_at") VALUES ('Summer Special', 'A beautiful summer-themed gallery', 1, '2025-03-22 11:52:11.143202', '2025-03-22 11:52:11.143202') RETURNING "id"
---
  def create
    gallery = @restaurant.galleries.new(gallery_params)

    if gallery.save

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = 1 LIMIT 1
---
  def set_restaurant
    @restaurant = Restaurant.find_by(id: params[:restaurant_id])