app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    restaurants = Restaurant.all

INSERT INTO "restaurants" ("name", "description", "created_at", "updated_at") VALUES ('The Spice Hub', 'A fine dining experience with authentic Indian cuisine.', '2025-03-22 10:42:19.423486', '2025-03-22 10:42:19.423486') RETURNING "id"
---
  def create
    restaurant = Restaurant.new(restaurant_params)

    if restaurant.save